balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F95J94.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="CTED6"/>
      <edc:VirtualPin edc:name="INSTR[15,7]"/>
      <edc:VirtualPin edc:name="EMUD"/>
      <edc:VirtualPin edc:name="ADDR8"/>
      <edc:VirtualPin edc:name="PGD"/>
      <edc:VirtualPin edc:name="SCANCFGDATA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RK2"/>
      <edc:VirtualPin edc:name="SEG58"/>
      <edc:VirtualPin edc:name="DSEG58"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="RP10" edc:ppsgroup="3" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSCI"/>
      <edc:VirtualPin edc:name="SCANSDI3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="RP6" edc:ppsgroup="3" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSCO"/>
      <edc:VirtualPin edc:name="SCANSDI2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RK3"/>
      <edc:VirtualPin edc:name="SEG59"/>
      <edc:VirtualPin edc:name="DSEG59"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSEL3b"/>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="CTED5"/>
      <edc:VirtualPin edc:name="INSTR[14,6]"/>
      <edc:VirtualPin edc:name="EMUC"/>
      <edc:VirtualPin edc:name="ADDR7"/>
      <edc:VirtualPin edc:name="PGC"/>
      <edc:VirtualPin edc:name="SCANCFGCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RK4"/>
      <edc:VirtualPin edc:name="SEG60"/>
      <edc:VirtualPin edc:name="DDIO0"/>
      <edc:VirtualPin edc:name="DSEG60"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="CTED4"/>
      <edc:VirtualPin edc:name="RP13" edc:ppsgroup="2" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="SEG8"/>
      <edc:VirtualPin edc:name="INSTR[13,5]"/>
      <edc:VirtualPin edc:name="ADDR6"/>
      <edc:VirtualPin edc:name="DSEG8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="CTED3"/>
      <edc:VirtualPin edc:name="RP12" edc:ppsgroup="1" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="SEG11"/>
      <edc:VirtualPin edc:name="INSTR[12,4]"/>
      <edc:VirtualPin edc:name="ADDR5"/>
      <edc:VirtualPin edc:name="DSEG11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="CTED2"/>
      <edc:VirtualPin edc:name="RP7" edc:ppsgroup="4" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="SEG10"/>
      <edc:VirtualPin edc:name="INSTR[11,3]"/>
      <edc:VirtualPin edc:name="ADDR4"/>
      <edc:VirtualPin edc:name="DSEG10"/>
      <edc:VirtualPin edc:name="SCANSDO3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="CTED1"/>
      <edc:VirtualPin edc:name="RP14" edc:ppsgroup="3" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="SEG9"/>
      <edc:VirtualPin edc:name="INSTR[10,2]"/>
      <edc:VirtualPin edc:name="ADDR3"/>
      <edc:VirtualPin edc:name="DSEG9"/>
      <edc:VirtualPin edc:name="SCANSDO2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RK5"/>
      <edc:VirtualPin edc:name="SEG61"/>
      <edc:VirtualPin edc:name="DDIO1"/>
      <edc:VirtualPin edc:name="DSEG61"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="RP9" edc:ppsgroup="2" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="INSTR[9,1]"/>
      <edc:VirtualPin edc:name="ADDR2"/>
      <edc:VirtualPin edc:name="VLCAP2"/>
      <edc:VirtualPin edc:name="SCANSDO1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="CTED13"/>
      <edc:VirtualPin edc:name="RP8" edc:ppsgroup="1" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="INSTR[8,0]"/>
      <edc:VirtualPin edc:name="ADDR1"/>
      <edc:VirtualPin edc:name="VLCAP1"/>
      <edc:VirtualPin edc:name="SCANSDO0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RJ3"/>
      <edc:VirtualPin edc:name="SEG35"/>
      <edc:VirtualPin edc:name="WRH"/>
      <edc:VirtualPin edc:name="DSEG35"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RJ2"/>
      <edc:VirtualPin edc:name="SEG34"/>
      <edc:VirtualPin edc:name="WRL"/>
      <edc:VirtualPin edc:name="DSEG34"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RJ1"/>
      <edc:VirtualPin edc:name="SEG33"/>
      <edc:VirtualPin edc:name="OE"/>
      <edc:VirtualPin edc:name="DSEG33"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RJ0"/>
      <edc:VirtualPin edc:name="SEG32"/>
      <edc:VirtualPin edc:name="ALE"/>
      <edc:VirtualPin edc:name="DSEG32"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="PSPD7"/>
      <edc:VirtualPin edc:name="REFO2"/>
      <edc:VirtualPin edc:name="RP27" edc:ppsgroup="4" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="SEG7"/>
      <edc:VirtualPin edc:name="AD7"/>
      <edc:VirtualPin edc:name="DSEG7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="PSPD6"/>
      <edc:VirtualPin edc:name="RP26" edc:ppsgroup="3" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="SEG6"/>
      <edc:VirtualPin edc:name="AD6"/>
      <edc:VirtualPin edc:name="DSEG6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RK6"/>
      <edc:VirtualPin edc:name="SEG62"/>
      <edc:VirtualPin edc:name="DSEG62"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="PSPD5"/>
      <edc:VirtualPin edc:name="RP25" edc:ppsgroup="2" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="SEG5"/>
      <edc:VirtualPin edc:name="AD5"/>
      <edc:VirtualPin edc:name="DSEG5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="PSPD4"/>
      <edc:VirtualPin edc:name="RP24" edc:ppsgroup="1" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="SEG4"/>
      <edc:VirtualPin edc:name="AD4"/>
      <edc:VirtualPin edc:name="DSEG4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="PSPD3"/>
      <edc:VirtualPin edc:name="RP23" edc:ppsgroup="4" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="SEG3"/>
      <edc:VirtualPin edc:name="AD3"/>
      <edc:VirtualPin edc:name="DSEG3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="PSPD2"/>
      <edc:VirtualPin edc:name="RP22" edc:ppsgroup="3" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="SEG2"/>
      <edc:VirtualPin edc:name="AD2"/>
      <edc:VirtualPin edc:name="DSEG2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RK7"/>
      <edc:VirtualPin edc:name="SEG63"/>
      <edc:VirtualPin edc:name="DSEG63"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="PSPD1"/>
      <edc:VirtualPin edc:name="RP21" edc:ppsgroup="2" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="SEG1"/>
      <edc:VirtualPin edc:name="AD1"/>
      <edc:VirtualPin edc:name="DSEG1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSEL0"/>
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="PSPD0"/>
      <edc:VirtualPin edc:name="RP20" edc:ppsgroup="1" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="SEG0"/>
      <edc:VirtualPin edc:name="AD0"/>
      <edc:VirtualPin edc:name="DSEG0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RL0"/>
      <edc:VirtualPin edc:name="SEG48"/>
      <edc:VirtualPin edc:name="DSEG48"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE7"/>
      <edc:VirtualPin edc:name="RP31" edc:ppsgroup="4" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="LCDBIAS0"/>
      <edc:VirtualPin edc:name="AD15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE6"/>
      <edc:VirtualPin edc:name="RP34" edc:ppsgroup="3" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="COM3"/>
      <edc:VirtualPin edc:name="AD14"/>
      <edc:VirtualPin edc:name="DCOM3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="RP37" edc:ppsgroup="2" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="COM2"/>
      <edc:VirtualPin edc:name="AD13"/>
      <edc:VirtualPin edc:name="DCOM2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="RP32" edc:ppsgroup="1" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="COM1"/>
      <edc:VirtualPin edc:name="AD12"/>
      <edc:VirtualPin edc:name="DCOM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RG7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="REFO1"/>
      <edc:VirtualPin edc:name="RP33" edc:ppsgroup="2" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="COM0"/>
      <edc:VirtualPin edc:name="AD11"/>
      <edc:VirtualPin edc:name="DCOM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="PSPCS"/>
      <edc:VirtualPin edc:name="RP30" edc:ppsgroup="3" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="LCDBIAS3"/>
      <edc:VirtualPin edc:name="AD10"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RH0"/>
      <edc:VirtualPin edc:name="AN23"/>
      <edc:VirtualPin edc:name="SEG47"/>
      <edc:VirtualPin edc:name="A16"/>
      <edc:VirtualPin edc:name="DSEG47"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RH1"/>
      <edc:VirtualPin edc:name="AN22"/>
      <edc:VirtualPin edc:name="SEG46"/>
      <edc:VirtualPin edc:name="A17"/>
      <edc:VirtualPin edc:name="DSEG46"/>
    </edc:Pin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI1" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="FLT0" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IOC0" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="MDCIN1" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T0CKI" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T5G" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3RX" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4RX" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2BCLK" edc:ppsgroup="1" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3DT" edc:ppsgroup="1" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4DT" edc:ppsgroup="1" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="1" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="P1D" edc:ppsgroup="1" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="P2D" edc:ppsgroup="1" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="P3D" edc:ppsgroup="1" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="CTPLS" edc:ppsgroup="1" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="CCP5" edc:ppsgroup="1" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="CCP8" edc:ppsgroup="1" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsgroup="1" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="PBIO0" edc:ppsgroup="1" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="PBIO4" edc:ppsgroup="1" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI2" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT1" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IOC1" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IOC5" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="MDCIN2" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T1CKI" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="TIG" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T3CKI" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T3G" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T5CKI" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3TX" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4TX" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1BCLK" edc:ppsgroup="2" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3CK" edc:ppsgroup="2" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4CK" edc:ppsgroup="2" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="2" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="P1C" edc:ppsgroup="2" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="P2C" edc:ppsgroup="2" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="P3C" edc:ppsgroup="2" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="CCP7" edc:ppsgroup="2" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="CCP9" edc:ppsgroup="2" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsgroup="2" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="PBIO1" edc:ppsgroup="2" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="PBIO5" edc:ppsgroup="2" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IOC2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IOC6" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="MDMIN" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1TX" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2RX" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="ECCP3" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1CK" edc:ppsgroup="3" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2DT" edc:ppsgroup="3" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3BCLK" edc:ppsgroup="3" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4BCLK" edc:ppsgroup="3" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="SCK2" edc:ppsgroup="3" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="P1B" edc:ppsgroup="3" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="P2B" edc:ppsgroup="3" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="ECCP3" edc:ppsgroup="3" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="CCP6" edc:ppsgroup="3" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="CCP10" edc:ppsgroup="3" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="PBIO2" edc:ppsgroup="3" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="PBIO6" edc:ppsgroup="3" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT3" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IOC3" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IOC7" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1RX" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2TX" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="ECCP1" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="ECCP2" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1DT" edc:ppsgroup="4" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2CK" edc:ppsgroup="4" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="SCK1" edc:ppsgroup="4" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="ECCP1A" edc:ppsgroup="4" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="ECCP2A" edc:ppsgroup="4" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="P3D" edc:ppsgroup="4" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="MDOUT" edc:ppsgroup="4" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="CCP4" edc:ppsgroup="4" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="CDOUT" edc:ppsgroup="4" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="PBIO3" edc:ppsgroup="4" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi">
      <edc:VirtualPin edc:name="PBIO7" edc:ppsgroup="4" edc:ppsval="14"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>